import React from 'react'
import { useSelector } from 'react-redux'
import { Navigate } from 'react-router-dom'
import styles from './Results.module.css'
import IQChart1 from './../images/IQ/Moadel hosh bahr-1.jpg'
import IQChart2 from './../images/IQ/Moadel hosh bahr-2.jpg'



export default function Results() {

    const selector = useSelector(state => state.websiteSlice)

    if (selector.IQTestPassed === false) {
        return <Navigate to='/E1' />
    }

    return (
        <div className={styles.container}>
            <div className={styles.innerContainer}>
                <span className={styles.description}>
                    دانش آموز عزیز؛ از این که تا انتها با ما همراه بودید از شما متشکریم. عملکرد شما در سنجش های اخذ شده به قرار زیر است. شما میتوانید از قسمت توضیحات به اطلاعات بیشتری در رابطه با آزمون های گرفته شده و تفسیر آنها دست پیدا کنید.
                </span>
                <div className={styles.IQContainer}>
                    <span>آزمون الگو</span>
                    <span>{selector.IQ.t}/60</span>
                </div>

                <div className={styles.SHContainer}>
                    <span>سلامت معنایی</span>
                    <span>{selector.SH.t}/120</span>
                </div>

                <div className={styles.PFContainer}>
                    <span className={styles.PFTitle}>ویژگی های شخصیتی</span>
                    <div>
                        <span>برونگرایی</span>
                        <span>{selector.PF.ef}/48</span>
                    </div>
                    <div>
                        <span>وجدانگرایی</span>
                        <span>{selector.PF.cf}/48</span>
                    </div>
                    <div>
                        <span>تجربه گرایی</span>
                        <span>{selector.PF.of}/48</span>
                    </div>
                    <div>
                        <span>توافق پذیری</span>
                        <span>{selector.PF.af}/48</span>
                    </div>
                    <div>
                        <span>روانرنجوری</span>
                        <span>{selector.PF.nf}/48</span>
                    </div>
                </div>

                <div className={styles.descriptionContainer}>
                    <span className={styles.descriptionTitle}>توضیحات</span>
                    <div className={styles.descriptionSectionContainer}>
                        <span className={styles.descriptionSectionTitle}>
                            آزمون الگو
                        </span>
                        <p className={styles.paragraph}>
                            آزمون ماتریس های پیشرونده ریون (که عمدتا آن را ماتریس های ریون می گویند) یا به اختصار RPM، مجموعه تست های غیر-زبانی (verbal) از ابزارهای رایج اندازه‌گیری استدلال قیاسی، توانایی درک مفاهیم انتزاعی و سنجش قوه ادراک است که معمولا در زمینه های آموزشی مورد استفاده قرار می گیرد. این آزمون ۶۰ سوالی، برای سنجش استدلال انتزاعی افراد به عنوان بخشی از هوش عمومی به کار گرفته می شود.
                            این تست برای کودکان و بزرگ‌سالان، صرف‌نظر از اینکه فرد مشکلات ارتباطی یا حرکتی داشته باشد، کارآمد است و به‌طور کلی، برای اکثر مردم جالب توجه و سرگرم‌کننده به حساب می‌آید.
                            این امر مستلزم توجه «گشتالت» (نظریه‌ای که طبق آن، دنیا را در «کل‌های معنی‌دار» تجربه می‌کنیم و محرک‌های جداگانه را نمی‌بینیم) و همچنین استدلال مشابهی است که در آن شخص باید از رفتار اکتشافی استفاده کند؛ افراد همچنین باید مقایسه کنند و از منابع مختلفی برای تکمیل ماتریس‌ها بهره‌مند شوند.
                            جان ریون گفته است که نباید فقط از این آزمایش برای سنجش هوش استفاده کنیم، بلکه باید منابع اطلاعاتی دیگری را نیز در نظر بگیریم تا این آزمون بسیار قدرتمندتر و نتایج آن قابل‌ استنادتر شوند.
                        </p>
                        <span className={styles.descriptionSectionTitle}>نمره دهی</span>
                        <p className={styles.paragraph}>شما میتوانید با استفاده از جداول زیر وضعیت کلی هوشی خود را سنجش کنید. با این وجود باید توجه داشته باشید که هنوز نظریه و ابزاری برای سنجش هوش که اتفاق نظر همگانی در رابطه با آن وجود داشته باشد موجود نیست و صرف نمره بالاتر در یک آزمون خاص نمیتواند تضمین کننده موفقیت فرد در مراحل بعدی زندگی باشد.</p>
                        <img src={IQChart1} className={styles.chartImage} />
                        <img src={IQChart2} className={styles.chartImage} />
                    </div>
                    <div className={styles.descriptionSectionContainer}>
                        <span className={styles.descriptionSectionTitle}>
                            آزمون سلامت معنایی
                        </span>
                        <p className={styles.paragraph}>
                            پرسشنامه سلامت معنایی پولوتزین-الیسون یکی از ابزارهایی است که به منظور سنجش سلامت معنایی در افراد مورد استفاده قرار میگیرد. بر طبق نظریه پولوتزین و الیسون (1982) سلامت معنایی دارای دو بعد عمودی و افقی است. بعد عمودی آن شامل احساس سلامتی در ارتباط با خالق و بعد افقی آن شامل احساس رضایت و هدفدار بودن در زندگی است . رضایی، سید فاطمی و ادیب حاج باقری (1387) در این باره می نویسند: سلامت معنایی تعادل بین جنبه های جسمی، روانی، اجتماعی و معنایی فرد است که باعث آرامش ذهن و احساس تمامیت و رفاه می شود و فرایندی از پیشرفت فرد به سوی ارتباطی هماهنگ است که از نیروهای درونی فرد سرچشمه می گیرد. سلامت معنایی در مراحل بالای هرم نیازهای مازلو قرار دارد و نمایانگر کیفیت زندگی فرد در بعد معنایی است (ص 32). زمانی که فردی اظهار سلامتی واقعی می کند، بدین معناست که او علاوه بر داشتن سلامت جسمی، به حقیقت و بنیان قوی معنایی در خود پی برده است (فراهانی نیا و عباسی، 1390، ص17).
                            در جمع بندی کلی این مبحث، در یک تعریف جامع و مانع و در ترسیم فضای مفهوم واژ ه ای سلامت معنایی شاید بتوان گفت سلامت معنایی عبارت است از برخورداری از حس پذیرش، احساسات مثبت، اخلاق، و حس ارتباط متقابل مثبت با یک قدرت حاکم و برتر، دیگران و خود که طی یک فرآیند پویا و هماهنگ شناختی، عاطفی، کنشی و پیامدی شخصی حاصل می آید. (عباسی و همکاران 1391).
                        </p>
                        <span className={styles.descriptionSectionTitle}>نمره دهی</span>
                        <p className={styles.paragraph}>در این آزمون نمره بالاتر شما نشان دهنده سلامت معنایی بالاتر شما است.</p>
                    </div>
                    <div className={styles.descriptionSectionContainer}>
                        <span className={styles.descriptionSectionTitle}>
                            آزمون ویژگی های شخصیتی
                        </span>
                        <p className={styles.paragraph}>
                            آزمون ۵ عامل بزرگ شخصیت نئو یکی از ابزارهایی است که برای سنجش ویژگی های شخصیتی افراد به کار برده میشود. این آزمون بر اساس نظریه ۵ عامل بزرگ شخصیت ساخته شده است که.
                        </p>
                        <span className={styles.descriptionSectionTitle}>نمره دهی</span>
                        <p className={styles.paragraph}>نمره بالاتر شما در هر یک از ۵ بعد نشان دهنده گرایش بالاتر شما به ویژگی های ذکر شده تحت آن است.</p>

                        <span className={styles.descriptionSectionTitle}>برونگرایی</span>
                        <p className={styles.paragraph}>
                            اگر در این بخش از تست نمره بالایی کسب شود، به معنای این است که فرد شرکت‌کننده، شخصیتی برون‌گرا، پرانرژی، قاطع و اجتماعی دارد. بااین‌حال ممکن است این فرد بسیار هیجانی هم باشد و به دنبال جلب‌توجه باشد.
                            در مقابل نمره پایین در این تست نشان‌دهنده میزان رضایت بالای فرد از شرایط فعلی است. این فرد محتاط است و انعکاس‌دهنده اتفاقات اطراف خود است. اما چنین فردی گوشه‌گیر است و برای بهبودی در روابط و ارتباطات اجتماعی خود به زمان بیش‌تری نیاز دارد.
                        </p>

                        <span className={styles.descriptionSectionTitle}>وجدانگرایی</span>
                        <p className={styles.paragraph}>
                            نمره بالا در این تست به معنای نظم بالا، کارآمدی، دارای جزئیات دقیق و سخت‌کوشی فرد موردنظر است. از طرفی هم این نمره بالا می‌تواند نشانگر سرسخت بودن و غیرقابل‌انعطاف بودن یک فرد تلقی شود.
                            نمره پایین در این تست به معنای سادگی یک فرد و انعطاف‌پذیری بالای اوست. البته بی‌نظمی، بی‌خیالی و رفتار سینوسی هم از دیگر ویژگی‌های فردی است که در این آزمون نمره پایین وظیفه‌شناسی را می‌گیرد.
                        </p>

                        <span className={styles.descriptionSectionTitle}>تجربه گرایی</span>
                        <p className={styles.paragraph}>
                            اگر نمره باز بودن بالا باشد، به این معنی است که فرد خلاقیت و ابتکار زیادی دارد و از مفاهیم انتزاعی بسیار خوشحال و هیجان‌زده خواهد شد. این فرد بسیار ماجراجوست و ممکن است برای حفظ تمرکز خود، مستعد بروز یک سری رفتار‌های غیرقابل‌پیش‌بینی باشد.
                            در مقابل نمره پایین در این بخش تست نئو به معنی این است که فرد موردنظر بسیار محتاط عمل می‌کند و می‌تواند گزینه قابل‌اعتمادی باشد. این فرد به دنبال تغییرات نیست و علاقه‌ای به تغییر ندارد.
                        </p>

                        <span className={styles.descriptionSectionTitle}>توافق پذیری</span>
                        <p className={styles.paragraph}>
                            نمره بالا در این بخش تست شخصیت نئو نشان می‌دهد که یک فرد رفتار دوستانه، دلسوزانه و تعاملی دارد. در واقع این فرد واقعاً به دیگران علاقه‌مند است. اما این افراد ممکن است در بسیاری از زمینه‌ها رفتاری داشته باشند که موجب سوء استفاده دیگران از اعتماد و محبت آن‌ها شود.
                            در مقابل نمره پایین در این بخش از تست نئو مشخص می‌کند که فرد موردنظر میزان رضایت‌مندی پایینی دارد و بسیار تحلیل‌گر و رقابتی است. این فرد به‌راحتی به دیگران اعتماد نمی‌کند و ممکن است برخی موارد را دستکاری هم کند.
                        </p>

                        <span className={styles.descriptionSectionTitle}>روانرنجوری</span>
                        <p className={styles.paragraph}>
                            اگر در این بخش از تفسیر تست نئو نمره بالایی کسب شود، نشان‌دهنده‌ی این است که فرد بسیار حساس و عصبی است. این فرد شخصیت همیشه نگرانی دارد و مستعد استرس و اضطراب افزایشی است. چنین فردی دائماً در معرض تغییرات خلق‌و‌خو خواهد بود.
                            در مقابل کسب نمره پایین در این بخش نشان می‌دهد که فرد موردنظر بسیار آرام، مطمئن و قابل‌کنترل است. چنین فردی به‌راحتی می‌تواند با استرس و اضطراب خود کنار بیاید و آن را کنترل کند. چنین فردی به‌صورت کلی از نظر احساسی کاملاً پایدار است.
                        </p>

                    </div>
                </div>
            </div>
        </div>
    )
}
