export const PFTestArray = [
    {
        num: '۱',
        name: 'i1',
        question: 'من اصولا شخص نگرانی نیستم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۲',
        name: 'i2',
        question: 'دوست دارم همیشه افراد زیادی دور و برم باشند.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۳',
        name: 'i3',
        question: 'دوست ندارم وقتم را با خیال پردازی تلف كنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۴',
        name: 'i4',
        question: 'سعی میكنم در مقابل همه مودب باشم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۵',
        name: 'i5',
        question: 'وسایل متعلق به خود را تمیز و مرتب نگاه می دارم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۶',
        name: 'i6',
        question: 'اغلب خود را كمتر از دیگران حس می كنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۷',
        name: 'i7',
        question: 'زود به خنده می افتم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۸',
        name: 'i8',
        question: 'هنگامی كه راه درست، كاری را پیدا كنم،آن روش را همیشه در آن مورد تكرار می كنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۹',
        name: 'i9',
        question: 'اغلب با فامیل و همكارانم بگو مگو دارم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۱۰',
        name: 'i10',
        question: 'به خوبی می توانم كارهایم را طوری تنظیم كنم كه درست سر زمان تعیین شده انجام شوند.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۱۱',
        name: 'i11',
        question: 'هنگامی كه تحت فشارهای روحی زیادی هستم، گاه احساس می كنم دارم خرد می شوم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۱۲',
        name: 'i12',
        question: 'خودم را فرد خیلی سر حال و سر زنده ای نمی دانم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۱۳',
        name: 'i13',
        question: 'نقش های موجود در پدیده های هنری و طبیعت مرا مبهوت می كند.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۱۴',
        name: 'i14',
        question: 'بعضی مردم فكر می كنند كه من نشخصی خود خواه و خود محورم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۱۵',
        name: 'i15',
        question: 'فرد خیلی مرتب و منظمی نیستم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۱۶',
        name: 'i16',
        question: 'به ندرت احساس تنهایی و غم می كنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۱۷',
        name: 'i17',
        question: 'واقعا از صحبت كردن با دیگران لذت می برم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۱۸',
        name: 'i18',
        question: 'فكر می كنم گوش دادن دانشجویان به مطالب متناقض فقط به سردرگمی و گمراهی آن ها منجر خواهد شد.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۱۹',
        name: 'i19',
        question: 'همكاری را بر رقابت با دیگران ترجیح می دهم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۲۰',
        name: 'i20',
        question: 'سعی می كنم همه كارهایم را با احساس مسولیت انجام دهم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۲۱',
        name: 'i21',
        question: 'اغلب احساس عصبی بودن و تنش می كنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۲۲',
        name: 'i22',
        question: 'همیشه برای كار آماده ام.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۲۳',
        name: 'i23',
        question: 'شعر تقریبا اثری بر من ندارد.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۲۴',
        name: 'i24',
        question: 'نسبت به قصد و نیت دیگران حساس  مشكوك هستم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۲۵',
        name: 'i25',
        question: 'دارای هدف روشنی هستم و برای رسیدن به آن طبق برنامه كار میكنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۲۶',
        name: 'i26',
        question: 'گاهی کاملا احساس بی ارزشی می كنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۲۷',
        name: 'i27',
        question: 'غالباً ترجیح می دهم كار ها را به تنهایی انجام دهم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۲۸',
        name: 'i28',
        question: 'اغلب غذاهای جدید و خارجی را امتحان می كنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۲۹',
        name: 'i29',
        question: 'معتقدم اگر به مردم اجازه  دهید، اكثر آن ها از شما سوء استفاده می كنند.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۳۰',
        name: 'i30',
        question: 'قبل از شروع هر كاری وقت زیادی را تلف می كنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۳۱',
        name: 'i31',
        question: 'به ندرت احساس اضطراب یا ترس می كنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۳۲',
        name: 'i32',
        question: 'اغلب احساس می كنم سرشار از انرژی هستم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۳۳',
        name: 'i33',
        question: 'به  ندرت به احساسات و عواطفی كه محیط های متفاوت به وجود  می آورند توجه می كنم .',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۳۴',
        name: 'i34',
        question: 'اغلب آشنایانم مرا دوست دارند.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۳۵',
        name: 'i35',
        question: 'برای رسیدن به اهدافم شدیداً تلاش می كنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۳۶',
        name: 'i36',
        question: 'اغلب از طرز برخورد دیگران با خودم عصبانی میشوم',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۳۷',
        name: 'i37',
        question: 'فردی خوشحال و بشاش و دارای روحیه خوبی هستم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۳۸',
        name: 'i38',
        question: 'معتقدم كه هنگام تصمیم گیری درباره مسائل اخلاقی باید از مراجع مذهبی پیروی كنیم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۳۹',
        name: 'i39',
        question: 'برخی فكر می كنند كه من فردی سرد و حسابگر هستم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۴۰',
        name: 'i40',
        question: 'وقتی قول یا تعهدی می دهم، همواره می توان برای عمل به آن روی من حساب كرد.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۴۱',
        name: 'i41',
        question: 'غالبا وقتی كارها پیش نمی روند، دلسرد شده و از كار صرف نظر می كنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۴۲',
        name: 'i42',
        question: 'شخص با نشاط و خوش بینی نیستم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۴۳',
        name: 'i43',
        question: 'بعضی اوقات وقتی شعری را می خوانم یا یك كار هنری را تماشا می كنم، یك احساس لرزش و یك تكان هیجانی را حس می كنم. ',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۴۴',
        name: 'i44',
        question: 'در روش هایم سرسخت و بی انعطاف هستم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۴۵',
        name: 'i45',
        question: 'گاهی آن طور كه باید و شاید قابل اعتماد و اتكاء نیستم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۴۶',
        name: 'i46',
        question: 'به ندرت غمگین و افسرده می شوم .',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۴۷',
        name: 'i47',
        question: 'زندگی و رویدادهای آن برایم سریع می گذرند.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۴۸',
        name: 'i48',
        question: 'علاقه ای به تامل و تفكر جدی درباره سرنوشت و ماهیت جهان یا انسان ندارم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۴۹',
        name: 'i49',
        question: 'عموماً سعی می كنم شخصی با ملاحظه و منطقی باشم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۵۰',
        name: 'i50',
        question: 'فرد مولدی هستم كه همیشه كارهایم را به اتمام می رسانم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۵۱',
        name: 'i51',
        question: 'اغلب احساس درماندگی می كنم و دنبال كسی می گردم كه مشكلاتم را برطرف كند.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۵۲',
        name: 'i52',
        question: 'شخص بسیار فعالی هستم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۵۳',
        name: 'i53',
        question: 'من كنجكاوی فكری فراوانی دارم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۵۴',
        name: 'i54',
        question: 'اگر كسی را دوست نداشته باشم،می گذارم متوجه این احساسم بشود.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۵۵',
        name: 'i55',
        question: 'فكر نمی كنم كه هیچ وقت بتوانم فردی منطقی بشوم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۵۶',
        name: 'i56',
        question: 'گاهی آنچنان خجالت زده شده ام كه فقط می خواستم خود را پنهان كنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۵۷',
        name: 'i57',
        question: 'ترجیح میدهم که برای خودم كار كنم تا راهبر دیگران باشم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 4 },
            { s: 'مخالفم', o: 2, p: 3 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 1 },
            { s: 'کاملا موافقم', o: 5, p: 0 }
        ]
    },
    {
        num: '۵۸',
        name: 'i58',
        question: 'اغلب از كلنجار رفتن با نظریه ها یا مفاهیم انتزاعی لذت می برم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۵۹',
        name: 'i59',
        question: 'اگر لازم باشد می توانم برای رسیدن به اهدافم دیگران را به طور ماهرانه ای به كار بگیرم. ',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    },
    {
        num: '۶۰',
        name: 'i60',
        question: 'تلاش می كنم هر كاری را به نحو ماهرانه ای انجام دهم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 0 },
            { s: 'مخالفم', o: 2, p: 1 },
            { s: 'خنثی', o: 3, p: 2 },
            { s: 'موافقم', o: 4, p: 3 },
            { s: 'کاملا موافقم', o: 5, p: 4 }
        ]
    }
]

