export const SHTestArray = [
    {
        num: '۱',
        name: 'i1',
        question:'در دعا و خلوت با خداوند احساس رضایت زیادی میکنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۲',
        name: 'i2',
        question:'نمیدانم که هستم، از کجا آمده ام و به کجا خواهم رفت.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 6 },
            { s: 'مخالفم', o: 2, p: 5 },
            { s: 'نسبتا مخالفم', o: 3, p: 4 },
            { s: 'نسبتا موافقم', o: 4, p: 3 },
            { s: 'موافقم', o: 5, p: 2 },
            { s: 'کاملا موافقم', o: 6, p: 1 },
        ]
    },
    {
        num: '۳',
        name: 'i3',
        question:'معتقدم که خدا مرا دوست دارد و در همه حال مراقب من است.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۴',
        name: 'i4',
        question:'احساس میکنم که زندگی یک تجربه مثبت و خوشایند است.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۵',
        name: 'i5',
        question:'من معتقدم که خدا در زندگی من نقش دارد.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۶',
        name: 'i6',
        question:'احساس میکنم که آینده نامعلومی دارم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 6 },
            { s: 'مخالفم', o: 2, p: 5 },
            { s: 'نسبتا مخالفم', o: 3, p: 4 },
            { s: 'نسبتا موافقم', o: 4, p: 3 },
            { s: 'موافقم', o: 5, p: 2 },
            { s: 'کاملا موافقم', o: 6, p: 1 },
        ]
    },
    {
        num: '۷',
        name: 'i7',
        question:'من با خدا ارتباط معنوی خاصی دارم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۸',
        name: 'i8',
        question:'در زندگی به حد کمال رسیده و کاملاً احساس رضایت میکنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۹',
        name: 'i9',
        question:'احساس میکنم که از جانب خدا حمایت شده و نیرو میگیرم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۱۰',
        name: 'i10',
        question:'نسبت به مسیر زندگی که در پیش رو دارم احساس خوبی میکنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۱۱',
        name: 'i11',
        question:'معتقدم که خدا به مشکلات من توجه میکند.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۱۲',
        name: 'i12',
        question:'من از زندگی ام لذت کافی میبرم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۱۳',
        name: 'i13',
        question:'ارتباط فردی رضایتبخشی با خداوند دارم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۱۴',
        name: 'i14',
        question:'در مورد آینده ام احساس خوبی دارم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۱۵',
        name: 'i15',
        question:'رابطه من با خدا به من کمک میکند که احساس تنهایی نکنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۱۶',
        name: 'i16',
        question:'من حس میکنم که زندگی پر از رنج و ناراحتی است.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 6 },
            { s: 'مخالفم', o: 2, p: 5 },
            { s: 'نسبتا مخالفم', o: 3, p: 4 },
            { s: 'نسبتا موافقم', o: 4, p: 3 },
            { s: 'موافقم', o: 5, p: 2 },
            { s: 'کاملا موافقم', o: 6, p: 1 },
        ]
    },
    {
        num: '۱۷',
        name: 'i17',
        question:'زمانی که ارتباط نزدیکی با خدا دارم احساس کمال میکنم.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۱۸',
        name: 'i18',
        question:'زندگی معنا و مفهوم زیادی دارد.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۱۹',
        name: 'i19',
        question:'ارتباط با خداوند در احساس سلامتی من نقش دارد.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
    {
        num: '۲۰',
        name: 'i20',
        question:'معتقدم هدف خاصی برای زنده بودنم وجود دارد.',
        options: [
            { s: 'کاملا مخالفم', o: 1, p: 1 },
            { s: 'مخالفم', o: 2, p: 2 },
            { s: 'نسبتا مخالفم', o: 3, p: 3 },
            { s: 'نسبتا موافقم', o: 4, p: 4 },
            { s: 'موافقم', o: 5, p: 5 },
            { s: 'کاملا موافقم', o: 6, p: 6 },
        ]
    },
]